#### Terraform Validation & Plan Results
* Terraform Version 📎`1.9.8`
* Working Directory 📂`./tests/e2e`
* Terraform Initialization ⚙️`success`
* Terraform Validation 🤖`success`
* Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
[0m[1mmodule.data_management_zone.data.azurerm_virtual_network.virtual_network: Reading...[0m[0m
[0m[1mmodule.data_management_zone.module.key_vault.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.data_management_zone.data.azurerm_network_security_group.network_security_group: Reading...[0m[0m
[0m[1mmodule.data_management_zone.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.data_management_zone.data.azurerm_route_table.route_table: Reading...[0m[0m
[0m[1mmodule.data_management_zone.module.purview_account.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.data_management_zone.azurerm_resource_group.unity_rg: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-unity-rg][0m
[0m[1mmodule.data_management_zone.azurerm_resource_group.automation_rg: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-automation-rg][0m
[0m[1mmodule.data_management_zone.azurerm_resource_group.governance_rg: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-governance-rg][0m
[0m[1mmodule.data_management_zone.azurerm_resource_group.consumption_rg: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-consumption-rg][0m
[0m[1mmodule.data_management_zone.module.purview_account.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0zMjBkNmZiNC02NzE2LTQ3OWYtYmQ3Ny1iZjgwZWY1NTliNzQ7b2JqZWN0SWQ9NjEyMDgxZTItYzAzNC00ZDkxLTkxZjgtNTBjNDM5MGZiZjUwO3N1YnNjcmlwdGlvbklkPTY2MGVkMTk2LTlkMDUtNDRmYy1iOTAyLTBjMTFjYTAxNGJkNjt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mmodule.data_management_zone.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0zMjBkNmZiNC02NzE2LTQ3OWYtYmQ3Ny1iZjgwZWY1NTliNzQ7b2JqZWN0SWQ9NjEyMDgxZTItYzAzNC00ZDkxLTkxZjgtNTBjNDM5MGZiZjUwO3N1YnNjcmlwdGlvbklkPTY2MGVkMTk2LTlkMDUtNDRmYy1iOTAyLTBjMTFjYTAxNGJkNjt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mmodule.data_management_zone.module.key_vault.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0zMjBkNmZiNC02NzE2LTQ3OWYtYmQ3Ny1iZjgwZWY1NTliNzQ7b2JqZWN0SWQ9NjEyMDgxZTItYzAzNC00ZDkxLTkxZjgtNTBjNDM5MGZiZjUwO3N1YnNjcmlwdGlvbklkPTY2MGVkMTk2LTlkMDUtNDRmYy1iOTAyLTBjMTFjYTAxNGJkNjt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mmodule.data_management_zone.azurerm_resource_group.container_rg: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-container-rg][0m
[0m[1mmodule.data_management_zone.data.azurerm_network_security_group.network_security_group: Read complete after 0s [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/networkSecurityGroups/ptt-dev-default-nsg001][0m
[0m[1mmodule.data_management_zone.module.synapse_private_link_hub.azurerm_synapse_private_link_hub.synapse_private_link_hub: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-consumption-rg/providers/Microsoft.Synapse/privateLinkHubs/mydmgmtdevsynplh001][0m
[0m[1mmodule.data_management_zone.module.container_registry.azurerm_container_registry.container_registry: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-container-rg/providers/Microsoft.ContainerRegistry/registries/mydmgmtdevacr001][0m
[0m[1mmodule.data_management_zone.module.databricks_access_connector.azurerm_databricks_access_connector.databricks_access_connector: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-unity-rg/providers/Microsoft.Databricks/accessConnectors/mydmgmt-dev-dbac001][0m
[0m[1mmodule.data_management_zone.module.key_vault.azurerm_key_vault.key_vault: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-governance-rg/providers/Microsoft.KeyVault/vaults/mydmgmt-dev-kv001][0m
[0m[1mmodule.data_management_zone.data.azurerm_route_table.route_table: Read complete after 0s [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/routeTables/ptt-dev-default-rt001][0m
[0m[1mmodule.data_management_zone.data.azurerm_virtual_network.virtual_network: Read complete after 0s [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/virtualNetworks/spoke-ptt-dev-vnet001][0m
[0m[1mmodule.data_management_zone.azapi_resource.private_endpoint_subnet: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/virtualNetworks/spoke-ptt-dev-vnet001/subnets/ServicesSubnet][0m
[0m[1mmodule.data_management_zone.module.user_assigned_identity.azurerm_user_assigned_identity.user_assigned_identity: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-automation-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/mydmgmt-dev-uai001][0m
[0m[1mmodule.data_management_zone.module.container_registry.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_container_registry: Reading...[0m[0m
[0m[1mmodule.data_management_zone.module.container_registry.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_container_registry: Read complete after 0s [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-container-rg/providers/Microsoft.ContainerRegistry/registries/mydmgmtdevacr001][0m
[0m[1mmodule.data_management_zone.module.container_registry.azurerm_monitor_diagnostic_setting.diagnostic_setting_container_registry["0"]: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-container-rg/providers/Microsoft.ContainerRegistry/registries/mydmgmtdevacr001|applicationLogs-0][0m
[0m[1mmodule.data_management_zone.module.container_registry.azurerm_private_endpoint.container_registry_private_endpoint: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-container-rg/providers/Microsoft.Network/privateEndpoints/mydmgmtdevacr001-registry-pe][0m
[0m[1mmodule.data_management_zone.module.synapse_private_link_hub.azurerm_private_endpoint.private_endpoint_synapse_private_link_hub_web: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-consumption-rg/providers/Microsoft.Network/privateEndpoints/mydmgmtdevsynplh001-web-pe][0m
[0m[1mmodule.data_management_zone.azapi_resource.databricks_private_subnet: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/virtualNetworks/spoke-ptt-dev-vnet001/subnets/DatabricksPrivateSubnet][0m
[0m[1mmodule.data_management_zone.module.key_vault.azurerm_role_assignment.current_roleassignment_key_vault: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-governance-rg/providers/Microsoft.KeyVault/vaults/mydmgmt-dev-kv001/providers/Microsoft.Authorization/roleAssignments/7dade4e4-d974-1099-4708-86c6fb5580fd][0m
[0m[1mmodule.data_management_zone.module.key_vault.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_key_vault: Reading...[0m[0m
[0m[1mmodule.data_management_zone.module.key_vault.azurerm_private_endpoint.private_endpoint_cognitive_account_vault: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-governance-rg/providers/Microsoft.Network/privateEndpoints/mydmgmt-dev-kv001-vault-pe][0m
[0m[1mmodule.data_management_zone.azapi_resource.databricks_public_subnet: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/virtualNetworks/spoke-ptt-dev-vnet001/subnets/DatabricksPublicSubnet][0m
[0m[1mmodule.data_management_zone.module.databricks_workspace.azurerm_databricks_workspace.databricks_workspace: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-unity-rg/providers/Microsoft.Databricks/workspaces/mydmgmt-dev-cnsmptn-dbw001][0m
[0m[1mmodule.data_management_zone.module.key_vault.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_key_vault: Read complete after 1s [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-governance-rg/providers/Microsoft.KeyVault/vaults/mydmgmt-dev-kv001][0m
[0m[1mmodule.data_management_zone.module.key_vault.azurerm_monitor_diagnostic_setting.diagnostic_setting_key_vault["0"]: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-governance-rg/providers/Microsoft.KeyVault/vaults/mydmgmt-dev-kv001|applicationLogs-0][0m
[0m[1mmodule.data_management_zone.module.databricks_workspace.azurerm_private_endpoint.private_endpoint_databricks_workspace_databricks_ui_api: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-unity-rg/providers/Microsoft.Network/privateEndpoints/mydmgmt-dev-cnsmptn-dbw001-uiapi-pe][0m
[0m[1mmodule.data_management_zone.module.databricks_workspace.azurerm_monitor_diagnostic_setting.diagnostic_setting_databricks_workspace["0"]: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-unity-rg/providers/Microsoft.Databricks/workspaces/mydmgmt-dev-cnsmptn-dbw001|applicationLogs-0][0m
[0m[1mmodule.data_management_zone.module.synapse_private_link_hub.time_sleep.sleep_connectivity: Refreshing state... [id=2024-11-18T21:25:18Z][0m
[0m[1mmodule.data_management_zone.module.container_registry.time_sleep.sleep_connectivity: Refreshing state... [id=2024-11-18T21:25:18Z][0m
[0m[1mmodule.data_management_zone.module.key_vault.time_sleep.sleep_connectivity: Refreshing state... [id=2024-11-18T21:25:17Z][0m
[0m[1mmodule.data_management_zone.module.databricks_workspace.azurerm_private_endpoint.private_endpoint_databricks_workspace_browser_authentication[0]: Refreshing state... [id=/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-unity-rg/providers/Microsoft.Network/privateEndpoints/mydmgmt-dev-cnsmptn-dbw001-auth-pe][0m
[0m[1mmodule.data_management_zone.module.databricks_workspace.time_sleep.sleep_connectivity: Refreshing state... [id=2024-11-18T21:31:12Z][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m
[31m-[0m/[32m+[0m destroy and then create replacement[0m
 [36m<=[0m read (data resources)[0m

Terraform will perform the following actions:

[1m  # module.data_management_zone.azurerm_resource_group.consumption_rg[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_resource_group" "consumption_rg" {
      [33m~[0m[0m id         = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-consumption-rg" -> (known after apply)
      [33m~[0m[0m name       = "mydmgmt-dev-consumption-rg" [33m->[0m[0m "mydmgmt-dev-consumption-syn-rg" [31m# forces replacement[0m[0m
      [31m-[0m[0m tags       = {} [90m-> null[0m[0m
        [90m# (2 unchanged attributes hidden)[0m[0m
    }

[1m  # module.data_management_zone.azurerm_resource_group.unity_rg[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_resource_group" "unity_rg" {
      [33m~[0m[0m id         = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-unity-rg" -> (known after apply)
      [33m~[0m[0m name       = "mydmgmt-dev-unity-rg" [33m->[0m[0m "mydmgmt-dev-consumption-adb-rg" [31m# forces replacement[0m[0m
      [31m-[0m[0m tags       = {} [90m-> null[0m[0m
        [90m# (2 unchanged attributes hidden)[0m[0m
    }

[1m  # module.data_management_zone.azurerm_role_assignment.purview_roleassignment_key_vault[0m will be created
[0m  [32m+[0m[0m resource "azurerm_role_assignment" "purview_roleassignment_key_vault" {
      [32m+[0m[0m id                               = (known after apply)
      [32m+[0m[0m name                             = (known after apply)
      [32m+[0m[0m principal_id                     = (known after apply)
      [32m+[0m[0m principal_type                   = (known after apply)
      [32m+[0m[0m role_definition_id               = (known after apply)
      [32m+[0m[0m role_definition_name             = "Key Vault Secrets User"
      [32m+[0m[0m scope                            = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-governance-rg/providers/Microsoft.KeyVault/vaults/mydmgmt-dev-kv001"
      [32m+[0m[0m skip_service_principal_aad_check = (known after apply)
    }

[1m  # module.data_management_zone.module.databricks_access_connector.azurerm_databricks_access_connector.databricks_access_connector[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_databricks_access_connector" "databricks_access_connector" {
      [33m~[0m[0m id                  = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-unity-rg/providers/Microsoft.Databricks/accessConnectors/mydmgmt-dev-dbac001" -> (known after apply)
        name                = "mydmgmt-dev-dbac001"
      [33m~[0m[0m resource_group_name = "mydmgmt-dev-unity-rg" [33m->[0m[0m "mydmgmt-dev-consumption-adb-rg" [31m# forces replacement[0m[0m
      [31m-[0m[0m tags                = {} [90m-> null[0m[0m
        [90m# (1 unchanged attribute hidden)[0m[0m

      [33m~[0m[0m identity {
          [31m-[0m[0m identity_ids = [] [90m-> null[0m[0m
          [33m~[0m[0m principal_id = "b03e2719-de48-4575-928a-19b53d7cc9d3" -> (known after apply)
          [33m~[0m[0m tenant_id    = "37963dd4-f4e6-40f8-a7d6-24b97919e452" -> (known after apply)
            [90m# (1 unchanged attribute hidden)[0m[0m
        }
    }

[1m  # module.data_management_zone.module.databricks_workspace.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_databricks_workspace[0m will be read during apply
  # (config refers to values not yet known)
[0m [36m<=[0m[0m data "azurerm_monitor_diagnostic_categories" "diagnostic_categories_databricks_workspace" {
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m log_category_groups = (known after apply)
      [32m+[0m[0m log_category_types  = (known after apply)
      [32m+[0m[0m metrics             = (known after apply)
      [32m+[0m[0m resource_id         = (known after apply)
    }

[1m  # module.data_management_zone.module.databricks_workspace.azurerm_databricks_workspace.databricks_workspace[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_databricks_workspace" "databricks_workspace" {
      [33m~[0m[0m access_connector_id                                 = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-unity-rg/providers/Microsoft.Databricks/accessConnectors/mydmgmt-dev-dbac001" -> (known after apply)
      [32m+[0m[0m disk_encryption_set_id                              = (known after apply)
      [33m~[0m[0m id                                                  = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-unity-rg/providers/Microsoft.Databricks/workspaces/mydmgmt-dev-cnsmptn-dbw001" -> (known after apply)
      [31m-[0m[0m managed_disk_cmk_rotation_to_latest_version_enabled = false [90m-> null[0m[0m
      [33m~[0m[0m managed_disk_identity                               = [] -> (known after apply)
      [33m~[0m[0m managed_resource_group_id                           = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-cnsmptn-dbw001-rg" -> (known after apply)
        name                                                = "mydmgmt-dev-cnsmptn-dbw001"
      [33m~[0m[0m resource_group_name                                 = "mydmgmt-dev-unity-rg" [33m->[0m[0m "mydmgmt-dev-consumption-adb-rg" [31m# forces replacement[0m[0m
      [33m~[0m[0m storage_account_identity                            = [] -> (known after apply)
      [31m-[0m[0m tags                                                = {} [90m-> null[0m[0m
      [33m~[0m[0m workspace_id                                        = "4498047611078992" -> (known after apply)
      [33m~[0m[0m workspace_url                                       = "adb-4498047611078992.12.azuredatabricks.net" -> (known after apply)
        [90m# (13 unchanged attributes hidden)[0m[0m

      [33m~[0m[0m custom_parameters {
          [32m+[0m[0m nat_gateway_name                                     = (known after apply)
          [33m~[0m[0m public_ip_name                                       = "nat-gw-public-ip" -> (known after apply)
          [33m~[0m[0m storage_account_name                                 = "dbstoragek7gdo3toldcq6" -> (known after apply)
          [33m~[0m[0m vnet_address_prefix                                  = "10.139" -> (known after apply)
            [90m# (8 unchanged attributes hidden)[0m[0m
        }
    }

[1m  # module.data_management_zone.module.databricks_workspace.azurerm_monitor_diagnostic_setting.diagnostic_setting_databricks_workspace["0"][0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_monitor_diagnostic_setting" "diagnostic_setting_databricks_workspace" {
      [33m~[0m[0m id                             = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-unity-rg/providers/Microsoft.Databricks/workspaces/mydmgmt-dev-cnsmptn-dbw001|applicationLogs-0" -> (known after apply)
      [32m+[0m[0m log_analytics_destination_type = (known after apply)
        name                           = "applicationLogs-0"
      [33m~[0m[0m target_resource_id             = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-unity-rg/providers/Microsoft.Databricks/workspaces/mydmgmt-dev-cnsmptn-dbw001" -> (known after apply) [31m# forces replacement[0m[0m
        [90m# (3 unchanged attributes hidden)[0m[0m

      [33m~[0m[0m enabled_log (known after apply)
      [31m-[0m[0m enabled_log {
          [31m-[0m[0m category_group = "allLogs" [90m-> null[0m[0m
            [90m# (1 unchanged attribute hidden)[0m[0m

          [31m-[0m[0m retention_policy {
              [31m-[0m[0m days    = 0 [90m-> null[0m[0m
              [31m-[0m[0m enabled = false [90m-> null[0m[0m
            }
        }

      [33m~[0m[0m metric (known after apply)
    }

[1m  # module.data_management_zone.module.databricks_workspace.azurerm_private_endpoint.private_endpoint_databricks_workspace_browser_authentication[0][0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_private_endpoint" "private_endpoint_databricks_workspace_browser_authentication" {
      [33m~[0m[0m custom_dns_configs            = [] -> (known after apply)
      [33m~[0m[0m id                            = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-unity-rg/providers/Microsoft.Network/privateEndpoints/mydmgmt-dev-cnsmptn-dbw001-auth-pe" -> (known after apply)
        name                          = "mydmgmt-dev-cnsmptn-dbw001-auth-pe"
      [33m~[0m[0m network_interface             = [
          [31m-[0m[0m {
              [31m-[0m[0m id   = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-unity-rg/providers/Microsoft.Network/networkInterfaces/mydmgmt-dev-cnsmptn-dbw001-auth-nic"
              [31m-[0m[0m name = "mydmgmt-dev-cnsmptn-dbw001-auth-nic"
            },
        ] -> (known after apply)
      [33m~[0m[0m private_dns_zone_configs      = [
          [31m-[0m[0m {
              [31m-[0m[0m id                  = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-unity-rg/providers/Microsoft.Network/privateEndpoints/mydmgmt-dev-cnsmptn-dbw001-auth-pe/privateDnsZoneGroups/mydmgmt-dev-cnsmptn-dbw001-arecord/privateDnsZoneConfigs/privatelink.azuredatabricks.net"
              [31m-[0m[0m name                = "privatelink.azuredatabricks.net"
              [31m-[0m[0m private_dns_zone_id = "/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.azuredatabricks.net"
              [31m-[0m[0m record_sets         = [
                  [31m-[0m[0m {
                      [31m-[0m[0m fqdn         = "northeurope.pl-auth.privatelink.azuredatabricks.net"
                      [31m-[0m[0m ip_addresses = [
                          [31m-[0m[0m "10.1.0.9",
                        ]
                      [31m-[0m[0m name         = "northeurope.pl-auth"
                      [31m-[0m[0m ttl          = 10
                      [31m-[0m[0m type         = "A"
                    },
                  [31m-[0m[0m {
                      [31m-[0m[0m fqdn         = "northeurope-c2.pl-auth.privatelink.azuredatabricks.net"
                      [31m-[0m[0m ip_addresses = [
                          [31m-[0m[0m "10.1.0.10",
                        ]
                      [31m-[0m[0m name         = "northeurope-c2.pl-auth"
                      [31m-[0m[0m ttl          = 10
                      [31m-[0m[0m type         = "A"
                    },
                ]
            },
        ] -> (known after apply)
      [33m~[0m[0m resource_group_name           = "mydmgmt-dev-unity-rg" [33m->[0m[0m "mydmgmt-dev-consumption-adb-rg" [31m# forces replacement[0m[0m
      [31m-[0m[0m tags                          = {} [90m-> null[0m[0m
        [90m# (3 unchanged attributes hidden)[0m[0m

      [33m~[0m[0m private_dns_zone_group {
          [33m~[0m[0m id                   = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-unity-rg/providers/Microsoft.Network/privateEndpoints/mydmgmt-dev-cnsmptn-dbw001-auth-pe/privateDnsZoneGroups/mydmgmt-dev-cnsmptn-dbw001-arecord" -> (known after apply)
            name                 = "mydmgmt-dev-cnsmptn-dbw001-arecord"
            [90m# (1 unchanged attribute hidden)[0m[0m
        }

      [33m~[0m[0m private_service_connection {
            name                              = "mydmgmt-dev-cnsmptn-dbw001-auth-svc"
          [33m~[0m[0m private_connection_resource_id    = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-unity-rg/providers/Microsoft.Databricks/workspaces/mydmgmt-dev-cnsmptn-dbw001" -> (known after apply) [31m# forces replacement[0m[0m
          [33m~[0m[0m private_ip_address                = "10.1.0.9" -> (known after apply)
            [90m# (4 unchanged attributes hidden)[0m[0m
        }
    }

[1m  # module.data_management_zone.module.databricks_workspace.azurerm_private_endpoint.private_endpoint_databricks_workspace_databricks_ui_api[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_private_endpoint" "private_endpoint_databricks_workspace_databricks_ui_api" {
      [33m~[0m[0m custom_dns_configs            = [] -> (known after apply)
      [33m~[0m[0m id                            = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-unity-rg/providers/Microsoft.Network/privateEndpoints/mydmgmt-dev-cnsmptn-dbw001-uiapi-pe" -> (known after apply)
        name                          = "mydmgmt-dev-cnsmptn-dbw001-uiapi-pe"
      [33m~[0m[0m network_interface             = [
          [31m-[0m[0m {
              [31m-[0m[0m id   = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-unity-rg/providers/Microsoft.Network/networkInterfaces/mydmgmt-dev-cnsmptn-dbw001-uiapi-nic"
              [31m-[0m[0m name = "mydmgmt-dev-cnsmptn-dbw001-uiapi-nic"
            },
        ] -> (known after apply)
      [33m~[0m[0m private_dns_zone_configs      = [
          [31m-[0m[0m {
              [31m-[0m[0m id                  = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-unity-rg/providers/Microsoft.Network/privateEndpoints/mydmgmt-dev-cnsmptn-dbw001-uiapi-pe/privateDnsZoneGroups/mydmgmt-dev-cnsmptn-dbw001-arecord/privateDnsZoneConfigs/privatelink.azuredatabricks.net"
              [31m-[0m[0m name                = "privatelink.azuredatabricks.net"
              [31m-[0m[0m private_dns_zone_id = "/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.azuredatabricks.net"
              [31m-[0m[0m record_sets         = [
                  [31m-[0m[0m {
                      [31m-[0m[0m fqdn         = "adb-4498047611078992.12.privatelink.azuredatabricks.net"
                      [31m-[0m[0m ip_addresses = [
                          [31m-[0m[0m "10.1.0.8",
                        ]
                      [31m-[0m[0m name         = "adb-4498047611078992.12"
                      [31m-[0m[0m ttl          = 10
                      [31m-[0m[0m type         = "A"
                    },
                ]
            },
        ] -> (known after apply)
      [33m~[0m[0m resource_group_name           = "mydmgmt-dev-unity-rg" [33m->[0m[0m "mydmgmt-dev-consumption-adb-rg" [31m# forces replacement[0m[0m
      [31m-[0m[0m tags                          = {} [90m-> null[0m[0m
        [90m# (3 unchanged attributes hidden)[0m[0m

      [33m~[0m[0m private_dns_zone_group {
          [33m~[0m[0m id                   = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-unity-rg/providers/Microsoft.Network/privateEndpoints/mydmgmt-dev-cnsmptn-dbw001-uiapi-pe/privateDnsZoneGroups/mydmgmt-dev-cnsmptn-dbw001-arecord" -> (known after apply)
            name                 = "mydmgmt-dev-cnsmptn-dbw001-arecord"
            [90m# (1 unchanged attribute hidden)[0m[0m
        }

      [33m~[0m[0m private_service_connection {
            name                              = "mydmgmt-dev-cnsmptn-dbw001-uiapi-svc"
          [33m~[0m[0m private_connection_resource_id    = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-unity-rg/providers/Microsoft.Databricks/workspaces/mydmgmt-dev-cnsmptn-dbw001" -> (known after apply) [31m# forces replacement[0m[0m
          [33m~[0m[0m private_ip_address                = "10.1.0.8" -> (known after apply)
            [90m# (4 unchanged attributes hidden)[0m[0m
        }
    }

[1m  # module.data_management_zone.module.purview_account.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_purview_account[0m will be read during apply
  # (config refers to values not yet known)
[0m [36m<=[0m[0m data "azurerm_monitor_diagnostic_categories" "diagnostic_categories_purview_account" {
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m log_category_groups = (known after apply)
      [32m+[0m[0m log_category_types  = (known after apply)
      [32m+[0m[0m metrics             = (known after apply)
      [32m+[0m[0m resource_id         = (known after apply)
    }

[1m  # module.data_management_zone.module.purview_account.azapi_resource.purview_account[0m will be created
[0m  [32m+[0m[0m resource "azapi_resource" "purview_account" {
      [32m+[0m[0m body                      = {
          [32m+[0m[0m properties = {
              [32m+[0m[0m cloudConnectors                     = [90mnull[0m[0m
              [32m+[0m[0m ingestionStorage                    = {
                  [32m+[0m[0m publicNetworkAccess = "Disabled"
                }
              [32m+[0m[0m managedEventHubState                = "Disabled"
              [32m+[0m[0m managedResourceGroupName            = "mydmgmt-dev-pview001-rg"
              [32m+[0m[0m managedResourcesPublicNetworkAccess = "Disabled"
              [32m+[0m[0m publicNetworkAccess                 = "Enabled"
              [32m+[0m[0m tenantEndpointState                 = "Enabled"
            }
          [32m+[0m[0m sku        = {
              [32m+[0m[0m capacity = 1
              [32m+[0m[0m name     = "Standard"
            }
        }
      [32m+[0m[0m id                        = (known after apply)
      [32m+[0m[0m ignore_casing             = false
      [32m+[0m[0m ignore_missing_property   = true
      [32m+[0m[0m location                  = "westus"
      [32m+[0m[0m locks                     = []
      [32m+[0m[0m name                      = "mydmgmt-dev-pview001"
      [32m+[0m[0m output                    = (known after apply)
      [32m+[0m[0m parent_id                 = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-governance-rg"
      [32m+[0m[0m response_export_values    = [
          [32m+[0m[0m "*",
        ]
      [32m+[0m[0m schema_validation_enabled = true
      [32m+[0m[0m tags                      = {}
      [32m+[0m[0m type                      = "Microsoft.Purview/accounts@2024-04-01-preview"

      [32m+[0m[0m identity {
          [32m+[0m[0m identity_ids = []
          [32m+[0m[0m principal_id = (known after apply)
          [32m+[0m[0m tenant_id    = (known after apply)
          [32m+[0m[0m type         = "SystemAssigned"
        }
    }

[1m  # module.data_management_zone.module.purview_account.azurerm_monitor_diagnostic_setting.diagnostic_setting_purview_account["0"][0m will be created
[0m  [32m+[0m[0m resource "azurerm_monitor_diagnostic_setting" "diagnostic_setting_purview_account" {
      [32m+[0m[0m id                             = (known after apply)
      [32m+[0m[0m log_analytics_destination_type = (known after apply)
      [32m+[0m[0m log_analytics_workspace_id     = "/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-logging-rg/providers/Microsoft.OperationalInsights/workspaces/ptt-dev-log001"
      [32m+[0m[0m name                           = "applicationLogs-0"
      [32m+[0m[0m target_resource_id             = (known after apply)

      [32m+[0m[0m enabled_log (known after apply)

      [32m+[0m[0m metric (known after apply)
    }

[1m  # module.data_management_zone.module.purview_account.azurerm_private_endpoint.private_endpoint_purview_account_ingestion_storage_blob[0m will be created
[0m  [32m+[0m[0m resource "azurerm_private_endpoint" "private_endpoint_purview_account_ingestion_storage_blob" {
      [32m+[0m[0m custom_dns_configs            = (known after apply)
      [32m+[0m[0m custom_network_interface_name = "mydmgmt-dev-pview001-ing-blob-nic"
      [32m+[0m[0m id                            = (known after apply)
      [32m+[0m[0m location                      = "northeurope"
      [32m+[0m[0m name                          = "mydmgmt-dev-pview001-ing-blob-pe"
      [32m+[0m[0m network_interface             = (known after apply)
      [32m+[0m[0m private_dns_zone_configs      = (known after apply)
      [32m+[0m[0m resource_group_name           = "mydmgmt-dev-governance-rg"
      [32m+[0m[0m subnet_id                     = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/virtualNetworks/spoke-ptt-dev-vnet001/subnets/ServicesSubnet"

      [32m+[0m[0m private_dns_zone_group {
          [32m+[0m[0m id                   = (known after apply)
          [32m+[0m[0m name                 = "mydmgmt-dev-pview001-arecord"
          [32m+[0m[0m private_dns_zone_ids = [
              [32m+[0m[0m "/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.blob.core.windows.net",
            ]
        }

      [32m+[0m[0m private_service_connection {
          [32m+[0m[0m is_manual_connection           = true
          [32m+[0m[0m name                           = "mydmgmt-dev-pview001-ing-blob-svc"
          [32m+[0m[0m private_connection_resource_id = (known after apply)
          [32m+[0m[0m private_ip_address             = (known after apply)
          [32m+[0m[0m request_message                = "Required for private connection."
          [32m+[0m[0m subresource_names              = [
              [32m+[0m[0m "blob",
            ]
        }
    }

[1m  # module.data_management_zone.module.purview_account.azurerm_private_endpoint.private_endpoint_purview_account_ingestion_storage_queue[0m will be created
[0m  [32m+[0m[0m resource "azurerm_private_endpoint" "private_endpoint_purview_account_ingestion_storage_queue" {
      [32m+[0m[0m custom_dns_configs            = (known after apply)
      [32m+[0m[0m custom_network_interface_name = "mydmgmt-dev-pview001-ing-queue-nic"
      [32m+[0m[0m id                            = (known after apply)
      [32m+[0m[0m location                      = "northeurope"
      [32m+[0m[0m name                          = "mydmgmt-dev-pview001-ing-queue-pe"
      [32m+[0m[0m network_interface             = (known after apply)
      [32m+[0m[0m private_dns_zone_configs      = (known after apply)
      [32m+[0m[0m resource_group_name           = "mydmgmt-dev-governance-rg"
      [32m+[0m[0m subnet_id                     = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/virtualNetworks/spoke-ptt-dev-vnet001/subnets/ServicesSubnet"

      [32m+[0m[0m private_dns_zone_group {
          [32m+[0m[0m id                   = (known after apply)
          [32m+[0m[0m name                 = "mydmgmt-dev-pview001-arecord"
          [32m+[0m[0m private_dns_zone_ids = [
              [32m+[0m[0m "/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.queue.core.windows.net",
            ]
        }

      [32m+[0m[0m private_service_connection {
          [32m+[0m[0m is_manual_connection           = true
          [32m+[0m[0m name                           = "mydmgmt-dev-pview001-ing-queue-svc"
          [32m+[0m[0m private_connection_resource_id = (known after apply)
          [32m+[0m[0m private_ip_address             = (known after apply)
          [32m+[0m[0m request_message                = "Required for private connection."
          [32m+[0m[0m subresource_names              = [
              [32m+[0m[0m "queue",
            ]
        }
    }

[1m  # module.data_management_zone.module.purview_account.azurerm_private_endpoint.private_endpoint_purview_account_platform[0m will be created
[0m  [32m+[0m[0m resource "azurerm_private_endpoint" "private_endpoint_purview_account_platform" {
      [32m+[0m[0m custom_dns_configs            = (known after apply)
      [32m+[0m[0m custom_network_interface_name = "mydmgmt-dev-pview001-platform-nic"
      [32m+[0m[0m id                            = (known after apply)
      [32m+[0m[0m location                      = "northeurope"
      [32m+[0m[0m name                          = "mydmgmt-dev-pview001-platform-pe"
      [32m+[0m[0m network_interface             = (known after apply)
      [32m+[0m[0m private_dns_zone_configs      = (known after apply)
      [32m+[0m[0m resource_group_name           = "mydmgmt-dev-governance-rg"
      [32m+[0m[0m subnet_id                     = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/virtualNetworks/spoke-ptt-dev-vnet001/subnets/ServicesSubnet"

      [32m+[0m[0m private_dns_zone_group {
          [32m+[0m[0m id                   = (known after apply)
          [32m+[0m[0m name                 = "mydmgmt-dev-pview001-arecord"
          [32m+[0m[0m private_dns_zone_ids = [
              [32m+[0m[0m "/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.purview-service.microsoft.com",
            ]
        }

      [32m+[0m[0m private_service_connection {
          [32m+[0m[0m is_manual_connection           = false
          [32m+[0m[0m name                           = "mydmgmt-dev-pview001-platform-svc"
          [32m+[0m[0m private_connection_resource_id = (known after apply)
          [32m+[0m[0m private_ip_address             = (known after apply)
          [32m+[0m[0m subresource_names              = [
              [32m+[0m[0m "platform",
            ]
        }
    }

[1m  # module.data_management_zone.module.purview_account.time_sleep.sleep_connectivity[0m will be created
[0m  [32m+[0m[0m resource "time_sleep" "sleep_connectivity" {
      [32m+[0m[0m create_duration = "10s"
      [32m+[0m[0m id              = (known after apply)
    }

[1m  # module.data_management_zone.module.synapse_private_link_hub.azurerm_private_endpoint.private_endpoint_synapse_private_link_hub_web[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_private_endpoint" "private_endpoint_synapse_private_link_hub_web" {
      [33m~[0m[0m custom_dns_configs            = [] -> (known after apply)
      [33m~[0m[0m id                            = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-consumption-rg/providers/Microsoft.Network/privateEndpoints/mydmgmtdevsynplh001-web-pe" -> (known after apply)
        name                          = "mydmgmtdevsynplh001-web-pe"
      [33m~[0m[0m network_interface             = [
          [31m-[0m[0m {
              [31m-[0m[0m id   = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-consumption-rg/providers/Microsoft.Network/networkInterfaces/mydmgmtdevsynplh001-web-nic"
              [31m-[0m[0m name = "mydmgmtdevsynplh001-web-nic"
            },
        ] -> (known after apply)
      [33m~[0m[0m private_dns_zone_configs      = [
          [31m-[0m[0m {
              [31m-[0m[0m id                  = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-consumption-rg/providers/Microsoft.Network/privateEndpoints/mydmgmtdevsynplh001-web-pe/privateDnsZoneGroups/mydmgmtdevsynplh001-arecord/privateDnsZoneConfigs/privatelink.azuresynapse.net"
              [31m-[0m[0m name                = "privatelink.azuresynapse.net"
              [31m-[0m[0m private_dns_zone_id = "/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.azuresynapse.net"
              [31m-[0m[0m record_sets         = [
                  [31m-[0m[0m {
                      [31m-[0m[0m fqdn         = "web.privatelink.azuresynapse.net"
                      [31m-[0m[0m ip_addresses = [
                          [31m-[0m[0m "10.1.0.7",
                        ]
                      [31m-[0m[0m name         = "web"
                      [31m-[0m[0m ttl          = 10
                      [31m-[0m[0m type         = "A"
                    },
                ]
            },
        ] -> (known after apply)
      [33m~[0m[0m resource_group_name           = "mydmgmt-dev-consumption-rg" [33m->[0m[0m "mydmgmt-dev-consumption-syn-rg" [31m# forces replacement[0m[0m
      [31m-[0m[0m tags                          = {} [90m-> null[0m[0m
        [90m# (3 unchanged attributes hidden)[0m[0m

      [33m~[0m[0m private_dns_zone_group {
          [33m~[0m[0m id                   = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-consumption-rg/providers/Microsoft.Network/privateEndpoints/mydmgmtdevsynplh001-web-pe/privateDnsZoneGroups/mydmgmtdevsynplh001-arecord" -> (known after apply)
            name                 = "mydmgmtdevsynplh001-arecord"
            [90m# (1 unchanged attribute hidden)[0m[0m
        }

      [33m~[0m[0m private_service_connection {
            name                              = "mydmgmtdevsynplh001-web-svc"
          [33m~[0m[0m private_connection_resource_id    = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-consumption-rg/providers/Microsoft.Synapse/privateLinkHubs/mydmgmtdevsynplh001" -> (known after apply) [31m# forces replacement[0m[0m
          [33m~[0m[0m private_ip_address                = "10.1.0.7" -> (known after apply)
            [90m# (4 unchanged attributes hidden)[0m[0m
        }
    }

[1m  # module.data_management_zone.module.synapse_private_link_hub.azurerm_synapse_private_link_hub.synapse_private_link_hub[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_synapse_private_link_hub" "synapse_private_link_hub" {
      [33m~[0m[0m id                  = "/subscriptions/660ed196-9d05-44fc-b902-0c11ca014bd6/resourceGroups/mydmgmt-dev-consumption-rg/providers/Microsoft.Synapse/privateLinkHubs/mydmgmtdevsynplh001" -> (known after apply)
        name                = "mydmgmtdevsynplh001"
      [33m~[0m[0m resource_group_name = "mydmgmt-dev-consumption-rg" [33m->[0m[0m "mydmgmt-dev-consumption-syn-rg" [31m# forces replacement[0m[0m
      [31m-[0m[0m tags                = {} [90m-> null[0m[0m
        [90m# (1 unchanged attribute hidden)[0m[0m
    }

[1mPlan:[0m 16 to add, 0 to change, 9 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>